{
    "en": {
        "about_heading": "About the App",
        "about_text": "Tires are one of the most crucial components of a vehicle. The only subsystem of a car that is in constant contact with the road is the tire subsystem. Therefore, it is essential to monitor the condition of the tires regularly. Tires have a significant impact on vehicle safety, including handling, braking, and overall performance.",
        "about_thesis": "This application was developed as part of a master's thesis titled 'Automatic Classification of Car Tire Condition Using Deep Learning Techniques' by Mateusz Szymański under the supervision of Dr. Janusz Rafałko.",
        "about_icon": "This project uses an icon by surang from Freepik, available at:",
        "download_heading": "Download",
        "download_android": "You can download the Android version of the app from the link below:",
        "download_ios": "For iOS users, visit the App Store to download the app.",
        "contact_heading": "Contact Us",
        "contact_text": "If you need any help, feel free to reach out via email:",
        "privacy_policy_heading": "Privacy Policy",
        "privacy_policy_intro": "Introduction",
        "privacy_policy_intro_text": "At TireInspectorAI, we respect your privacy and are committed to protecting your personal data. This privacy policy explains how we collect, use, and safeguard your information when you use our application.",
        "privacy_policy_data_collection": "Data Collection",
        "privacy_policy_data_collection_text": "We collect the following types of data:",
        "privacy_policy_data_item1": "Personal identification information (such as name, email address) for account creation and authentication.",
        "privacy_policy_data_item2": "Photos of tires uploaded by users for inspection purposes.",
        "privacy_policy_data_use": "How We Use Your Data",
        "privacy_policy_data_use_text": "Your data is used for the following purposes:",
        "privacy_policy_data_use_item1": "Authenticating users via Google, Apple, and email logins.",
        "privacy_policy_data_use_item2": "Analyzing tire images using machine learning models to detect defects.",
        "privacy_policy_data_use_item3": "Storing results for future reference in your account.",
        "privacy_policy_data_protection": "Data Protection",
        "privacy_policy_data_protection_text": "We use industry-standard encryption and security measures to protect your data. Access to personal data is restricted to authorized personnel only.",
        "privacy_policy_data_deletion": "Data Deletion",
        "privacy_policy_data_deletion_text": "You can request the deletion of your account and all associated data by contacting us at: tireinspectorai.support@gmail.com.",
        "privacy_policy_changes": "Changes to This Policy",
        "privacy_policy_changes_text": "We may update this privacy policy from time to time. You will be notified of any significant changes via email or through our app.",
        "privacy_policy_contact": "Contact Us",
        "privacy_policy_contact_text": "If you have any questions about this privacy policy, please contact us at"
    },
    "pl": {
        "about_heading": "O Aplikacji",
        "about_text": "Opony są jednym z najważniejszych elementów pojazdu. Jedynym podsystemem samochodu, który ma ciągły kontakt z drogą, jest układ opon. Dlatego ważne jest, aby regularnie monitorować stan opon. Opony mają znaczący wpływ na bezpieczeństwo pojazdu, w tym prowadzenie, hamowanie i ogólną wydajność.",
        "about_thesis": "Aplikacja została opracowana w ramach pracy magisterskiej pt. 'Automatyczna klasyfikacja stanu opon samochodowych z wykorzystaniem technik głębokiego uczenia' autorstwa Mateusza Szymańskiego pod kierunkiem dr. inż. Janusza Rafałko.",
        "about_icon": "Projekt wykorzystuje ikonę autorstwa surang z Freepik, dostępną pod adresem: ",
        "download_heading": "Pobierz",
        "download_android": "Możesz pobrać wersję aplikacji na Androida z poniższego linku:",
        "download_ios": "Użytkownicy iOS mogą pobrać aplikację w App Store.",
        "contact_heading": "Kontakt",
        "contact_text": "Jeśli potrzebujesz pomocy, skontaktuj się z nami przez e-mail:",
        "privacy_policy_heading": "Polityka prywatności",
        "privacy_policy_intro": "Wstęp",
        "privacy_policy_intro_text": "W TireInspectorAI szanujemy Twoją prywatność i zobowiązujemy się chronić Twoje dane osobowe. Niniejsza polityka prywatności wyjaśnia, w jaki sposób zbieramy, wykorzystujemy i chronimy Twoje informacje, gdy korzystasz z naszej aplikacji.",
        "privacy_policy_data_collection": "Zbieranie danych",
        "privacy_policy_data_collection_text": "Zbieramy następujące rodzaje danych:",
        "privacy_policy_data_item1": "Dane identyfikacyjne (takie jak imię, adres e-mail) do tworzenia kont i uwierzytelniania.",
        "privacy_policy_data_item2": "Zdjęcia opon przesłane przez użytkowników w celu ich inspekcji.",
        "privacy_policy_data_use": "Wykorzystanie danych",
        "privacy_policy_data_use_text": "Twoje dane są wykorzystywane w następujących celach:",
        "privacy_policy_data_use_item1": "Uwierzytelnianie użytkowników za pomocą logowania przez Google, Apple i email.",
        "privacy_policy_data_use_item2": "Analiza obrazów opon za pomocą modeli uczenia maszynowego w celu wykrywania defektów.",
        "privacy_policy_data_use_item3": "Przechowywanie wyników do przyszłego odniesienia w Twoim koncie.",
        "privacy_policy_data_protection": "Ochrona danych",
        "privacy_policy_data_protection_text": "Stosujemy standardowe w branży metody szyfrowania i zabezpieczeń, aby chronić Twoje dane. Dostęp do danych osobowych mają tylko upoważnione osoby.",
        "privacy_policy_data_deletion": "Usuwanie danych",
        "privacy_policy_data_deletion_text": "Możesz zażądać usunięcia swojego konta i wszystkich powiązanych danych, kontaktując się z nami pod adresem: tireinspectorai.support@gmail.com.",
        "privacy_policy_changes": "Zmiany w tej polityce",
        "privacy_policy_changes_text": "Od czasu do czasu możemy aktualizować niniejszą politykę prywatności. O wszelkich istotnych zmianach zostaniesz powiadomiony e-mailem lub za pośrednictwem naszej aplikacji.",
        "privacy_policy_contact": "Skontaktuj się z nami",
        "privacy_policy_contact_text": "Jeśli masz jakiekolwiek pytania dotyczące tej polityki prywatności, skontaktuj się z nami pod adresem"
    }
}